backend/controllers/PostController.php

INSERT INTO `post` (`title`, `description`, `category`, `owner`, `date`) VALUES ('rwqqwrqwr', 'rwqqwrqwr', 1, 2, '2017-04-20')
INSERT INTO `posttags` (`tagsid`, `postid`) VALUES (4, 103)
---
    public function actionCreate() {
        if (isset(Yii::$app->user->identity->id)) {
            $model = new POST();

            if ($model->load(Yii::$app->request->post())) {

                $model->category = $_POST['Post']['category'];
                $model->title = $_POST['Post']['title'];
                $model->description = $_POST['Post']['description'];
                $model->owner = Yii::$app->user->identity->id;
                $model->date = date('Y-m-d');
                $model->save();
         $id2=  Yii::$app->db->getLastInsertID();
         $arr=$_POST['Post']['ManyTags'];



         foreach ($arr as $key => $value) {
   $model2=new \app\models\Posttags();

             $model2->tagsid=$value;
              $model2->postid=$id2;

           $model2->save();

SELECT EXISTS(SELECT * FROM `post` WHERE (`id`='103'))
---
            $model = new \common\models\LoginForm();


            $query = \app\models\Post::find();

UPDATE `post` SET `category`=1 WHERE `id`=102
---
    public function actionUpdate($id) {
        if (isset(Yii::$app->user->identity->id)) {

            $model = $this->findModel($id);

            if ($model->load(Yii::$app->request->post()) && $model->save()) {

SELECT * FROM `post` WHERE `id`='102'
---
    protected function findModel($id) {
        if (($model = POST::findOne($id)) !== null) {