backend/controllers/SiteController.php

    public function actionIndex()
    {

        $query = \app\models\Post::find();

        $pagination = new \yii\data\Pagination([
            'defaultPageSize' => 2,
            'totalCount' => $query->count(),
        ]);
        $post = $query
            ->offset($pagination->offset)
            ->limit($pagination->limit)
            ->all();
---
SELECT COUNT(*) FROM `post`
SELECT * FROM `post` LIMIT 2 OFFSET 4