backend/views/post/_form.php

<div class="post-form">

    <?php $form = ActiveForm::begin();
    $item = \app\models\Categories::find()->all();
---
SELECT * FROM `categories`


<?= $form->field($model, 'category')->dropDownList($item) ?>

    <?php        $item2 = \app\models\Tags::find()->all();
---
SELECT * FROM `tags`