backend/models/Categories.php

SELECT * FROM `categories` WHERE `id`=1
---
 public static function getcatt($id){
return self::findOne(['id'=>$id]);