backend/models/UserE.php

SELECT * FROM `user` WHERE `username`='admin'
---
	public static function findByUsername($username){
		return self::findOne(['username'=>$username]);

SELECT * FROM `user` WHERE `id`=2
---
	public static function getusername($id){
		return self::findOne(['id'=>$id]);